# import json
# dict1={'1号':18, '2号':28, '3号':38, '4号':48} #字典格式  ,直接用{}表示

# json1='{"1号":18,"2号":28,"3号":38,"4号":48}'  #json格式  ,开始和结束必须有'' ,  键必须用双引号表示字符串

# json1= json.dumps(dict1,ensure_ascii=False)       #将字典转换为json字符串,ensure_ascii=False表示可以直接输出中文字符
# print(json1)
# print(type(json1))
# dict2=json.loads(json1)                         #将json字符串转换为字典
# print(dict2)
# print(type(dict2))

# Numpy库的语法
# 多维数组
# c = np.array([          # 2维数组,可以看到有两个括号
#     [1,2],
#     [3,4]
# ])
# print(c)                # [[1 2]
#                         #  [3 4]]
# d = np.array([          # 3维数组,可以看到有三个括号
#     [
#         [5,6],
#         [7,8]
#     ],
#     [
#         [9,10],
#         [11,12]
#     ]
# ])
# print(d)                # [[[ 5  6]
#                         #    [ 7  8]]

#                         #    [[ 9 10]
#                         #    [11 12]]]
                        
# np.range()函数,生成一个等差数列的数组,默认步长为1,默认为整数
# e1 = np.arange(10)
# print(e1)                # [0 1 2 3 4 5 6 7 8 9]
# e2 = np.arange(0,1,0.1)
# print(e2)                # [0.  0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9]

# # np.zeros()函数,生成一个全0的数组，默认为浮点数
# e3 = np.zeros((2,3))     # 生成一个包含2个一维数组,每个一维数组有3个元素
# print(e3)                # [[0. 0. 0.]
#                          #  [0. 0. 0.]]
# # np.ones()函数,生成一个全1的数组，默认为浮点数
# e4 = np.ones((2,3,4))   # 生成一个包含2个二维数组,3个一维数组,每个一维数组再包含4个元素
# print(e4)                # [[[1. 1. 1. 1.]
#                          #  [1. 1. 1. 1.]
#                          #  [1. 1. 1. 1.]]

#                          #  [[1. 1. 1. 1.]
#                          #  [1. 1. 1. 1.]
#                          #  [1. 1. 1. 1.]]]

# # np.empty()函数,生成一个随机的数组,默认为浮点数
# e5 = np.empty((2,3))     # 生成一个包含2个一维数组,每个一维数组有3个元素
# print(e5)                # 随机的浮点数二维数组

# # np.full()函数,生成一个可指定元素的数组，默认为None
# e6 = np.full((2,3),1)    # 生成一个包含2个一维数组,每个一维数组有3个元素,每个元素都为1
# print(e6)                # [[1 1 1]
#                          #  [1 1 1]]

# # Numpy 语法的学习
import numpy as np
# # numpy的切片操作
# a = np.array([[1,2,3],
#               [4,5,6],
#               [7,8,9]])
# # 一维切片操作

# row2 = a[0:2]               # 连续切片
# print(row2)   # [[1 2 3]
#               #  [4 5 6]]

# row3 = a[[0,2]]             # 不连续切片
# print(row3)   # [[1 2 3]
#               #  [7 8 9]]   # 这里取的是第0行和第2行,而不是第0行和第1行

# #  二维切片操作
# row4 = a[0:2,0:2]           # 连续切片     判断是否多维切片就看是否有逗号,且逗号不是用来表示不连续切片的
# print(row4)   # [[1 2]
#               #  [4 5]]

# row = a[:,1]                # 列切片     取第1列
# print(row)   # [2 5 8]

# row5 = a[[0,2],[0,2]]
# print(row5)   # [1 9]       # 可能是第一行的第一个元素和第三行的第三个元素吧

# ndarray数组的属性

# a = np.array([1,2,3],[4,5,6])
# print(a.shape)   # (2,3)        #查看数组形状
# print(a.dtype)   # int32        #查看数组元素类型,默认为int32
# print(a.size)    # 6(2*3=6)     #查看数组元素个数
# print(a.ndim)    # 2 (2维数组)   #查看数组的维度

# 改变ndarray数组的数据类型和形状
# a = np.array([[1.1,2,3],[4,5,6]],dtype=np.float64)
# # 改变数组的数据类型
# a1=a.astype(np.int32)      # 默认无视类型报错,且会生成一个新的数组
# print(a1)      # [[1 2 3]
#               #  [4 5 6]]

# # 改变数组的形状

# # reshape改变数组的形状
# a2 = a.reshape(3,2)      # 3行2列
# print(a2)     # [[1 2]
#               #  [3 4]
#               #  [5 6]]

# # resize改变数组的大小
# a.resize((3,3),refcheck=False)           # 改变原数组的形状,不够会填充0,超出会截断,
# print(a)      # [[1 2 3]                 # refcheck 即引用的检查
#               #  [4 5 6]
#               #  [0 0 0]]

# # flatten改变数组成一维
# a3 = a.flatten()              # 将数组转换为一维数组(展平),生成副本,不改变原数组
# print(a3)      # [[1 2 3 4 5 6]]

# # ravel改变数组成一维
# a4 = a.ravel(order='C')              # 将数组转换为一维数组(展平),
# print(a4)      # [[1 2 3 4 5 6]]
# a4[0]=999                   # a4是a的视图(C),两者的引用相同,如果order='F',两者的引用不同
# print(a)                    # [[999 2 3]    改了a4,也改变了a
#                             #  [4 5 6]]

# # 使数组转置
# a5 = a.T              # 转置数组,行变列,列变行
# print(a5)      # [[1 4]
#                #  [2 5]
#                #  [3 6]]
